In [1]:
import pandas as pd

In [2]:
Create a dictionary which contains keys> Name, Marks,Result
convert dictionary into dataframe
Access values using square barackets
access values using iloc
access values using loc

SyntaxError: invalid syntax (3492605680.py, line 1)

##### Create a dictionary which contains keys> Name, Marks,Result

In [3]:
stud={"NAME":["AMRUTHA","ARATHI","ASWIN","ADARSH","ABHIJITH","DEVIKA","GOPIKA"],"MARKS":[45,68,60,70,34,59,72],"RESULT":["FAIL","PASS","PASS","PASS","FAIL","PASS","PASS"]}

In [4]:
stud

{'NAME': ['AMRUTHA',
  'ARATHI',
  'ASWIN',
  'ADARSH',
  'ABHIJITH',
  'DEVIKA',
  'GOPIKA'],
 'MARKS': [45, 68, 60, 70, 34, 59, 72],
 'RESULT': ['FAIL', 'PASS', 'PASS', 'PASS', 'FAIL', 'PASS', 'PASS']}

##### convert dictionary into dataframe

In [5]:
students=pd.DataFrame(stud)

In [14]:
students

       NAME  MARKS RESULT
0   AMRUTHA     45   FAIL
1    ARATHI     68   PASS
2     ASWIN     60   PASS
3    ADARSH     70   PASS
4  ABHIJITH     34   FAIL
5    DEVIKA     59   PASS
6    GOPIKA     72   PASS

In [16]:
students.iloc[1:3,[0,1]]

     NAME  MARKS
1  ARATHI     68
2   ASWIN     60

##### Access values using square barackets

In [10]:
students["NAME"]

0     AMRUTHA
1      ARATHI
2       ASWIN
3      ADARSH
4    ABHIJITH
5      DEVIKA
6      GOPIKA
Name: NAME, dtype: object

In [11]:
students["MARKS"]

0    45
1    68
2    60
3    70
4    34
5    59
6    72
Name: MARKS, dtype: int64

In [22]:
students["RESULT"]

0    FAIL
1    PASS
2    PASS
3    PASS
4    FAIL
5    PASS
6    PASS
Name: RESULT, dtype: object

In [31]:
students[:]

       NAME  MARKS RESULT
0   AMRUTHA     45   FAIL
1    ARATHI     68   PASS
2     ASWIN     60   PASS
3    ADARSH     70   PASS
4  ABHIJITH     34   FAIL
5    DEVIKA     59   PASS
6    GOPIKA     72   PASS

In [33]:
students[:4]

      NAME  MARKS RESULT
0  AMRUTHA     45   FAIL
1   ARATHI     68   PASS
2    ASWIN     60   PASS
3   ADARSH     70   PASS

In [34]:
students[2:]

       NAME  MARKS RESULT
2     ASWIN     60   PASS
3    ADARSH     70   PASS
4  ABHIJITH     34   FAIL
5    DEVIKA     59   PASS
6    GOPIKA     72   PASS

##### access values using iloc

In [24]:
students.iloc[4]

NAME      ABHIJITH
MARKS           34
RESULT        FAIL
Name: 4, dtype: object

In [13]:
students.iloc[[6],[0,2]]

     NAME RESULT
6  GOPIKA   PASS

In [25]:
students.iloc[0]

NAME      AMRUTHA
MARKS          45
RESULT       FAIL
Name: 0, dtype: object

In [26]:
students.iloc[-1]

NAME      GOPIKA
MARKS         72
RESULT      PASS
Name: 6, dtype: object

In [28]:
students.iloc[[0,5]]

      NAME  MARKS RESULT
0  AMRUTHA     45   FAIL
5   DEVIKA     59   PASS

In [12]:
students.iloc[0:5,2]

0    FAIL
1    PASS
2    PASS
3    PASS
4    FAIL
Name: RESULT, dtype: object

In [35]:
students.iloc[[-1],[0,1]]

     NAME  MARKS
6  GOPIKA     72

In [36]:
students.iloc[0:5,0:1]

       NAME
0   AMRUTHA
1    ARATHI
2     ASWIN
3    ADARSH
4  ABHIJITH

In [13]:
students.iloc[[1,6]]

     NAME  MARKS RESULT
1  ARATHI     68   PASS
6  GOPIKA     72   PASS

##### access values using loc

In [37]:
students.loc[1]

NAME      ARATHI
MARKS         68
RESULT      PASS
Name: 1, dtype: object

In [40]:
students.loc[[1,6]]

     NAME  MARKS RESULT
1  ARATHI     68   PASS
6  GOPIKA     72   PASS

In [46]:
students.loc[1:3,"NAME"]

1    ARATHI
2     ASWIN
3    ADARSH
Name: NAME, dtype: object

In [47]:
students.loc[1,"NAME":"RESULT"]

NAME      ARATHI
MARKS         68
RESULT      PASS
Name: 1, dtype: object

In [50]:
students.loc[1:5,"NAME":"MARKS"]

       NAME  MARKS
1    ARATHI     68
2     ASWIN     60
3    ADARSH     70
4  ABHIJITH     34
5    DEVIKA     59

In [51]:
students.loc[[1,6],["NAME","RESULT"]]

     NAME RESULT
1  ARATHI   PASS
6  GOPIKA   PASS